/* 
  Localizable.strings (English)
  AMD Power Gadget
*/

/* NOTE: Some keys use Spanish text for historical reasons. */
/* These are used as lookup identifiers and work correctly. */
/* A future refactor should standardize all keys to English. */

"Dashboard" = "Hallintapaneeli";
"Telemetry" = "Kaukomittaus";
"Fan Control" = "Puhaltimen Ohjaus";
"Profiles" = "Profiles";
"Advanced" = "Lisäasetukset";
"Menu Bar" = "Valikkorivi";
"System Info" = "Järjestelmän Tiedot";
"Desktop Widgets" = "Työpöydän Widgetit";

"AMD Power" = "Amd Teho";
"Gadget" = "Gadget";

"CPU" = "Suoritin";
"GPU" = "GPU";
"Freq" = "Freq";
"Average" = "Keskiarvo";
"Avg: %@" = "Keskiarvo: %@";
"Collecting data…" = "Collecting data…";

"Low Power Mode (LPM)" = "Matala Teho (LPM)";
"Allows macOS to auto-manage CPU frequency" = "Mahdollistaa macOS:n automaattisen suoritinhallinnan";
"Forces CPU to lowest frequency for minimum power" = "Pakottaa suorittimen pienimpään taajuuteen pienimmän tehon";
"Core Performance Boost (CPB)" = "Ydin Suorituskyvyn Tehostus (Cpb)";
"Update Interval" = "Päivityksen Aikaväli";
"Adjust how frequently telemetry data updates. Lower = more responsive, higher = less CPU usage." = "Säädä kuinka usein telemetriadatan päivityksiä. Alempi = reagoivampi, korkeampi = vähemmän prosessorin käyttö.";

"Opciones en Menú Bar" = "Valikkorivin Asetukset";
"Choose which items appear in the menu bar. Changes apply immediately." = "Valitse, mitkä kohteet näkyvät valikkopalkissa. Muutokset tulevat voimaan välittömästi.";
"Customize the visual appearance of the menu bar items." = "Mukauta valikkopalkin nimikkeiden visuaalista ulkonäköä.";
"Límite de Temp de Alerta" = "Hälytyksen Temp Raja";
"Color de Alerta de Temp" = "Hälytyksen Temp Väri";
"Color de Flechas" = "Nuolet Väri";
"Additional telemetry for the menu bar." = "Lisää telemetriaa valikkopalkkia varten.";
"GPU data is shown inside Temp, Power, Memory and Fan columns when enabled." = "GPU-tiedot näytetään Temp-, Power-, Memory and Fan -sarakkeissa, kun ne otetaan käyttöön.";
"Show GPU VRAM" = "Näytä GPU VRAM";
"G:X.XG in Memory column" = "G:X.XG muistisarakkeessa";
"Show GPU Fan Speed" = "Näytä Gpu Puhaltimen Nopeus";
"G:XXXX in Fan column" = "G:XXXX tuulettimen sarake";

"No fans detected." = "Tuulettimia ei havaittu.";
"SMC driver not available" = "SMC-ajuri ei ole käytettävissä";
"Your SMC chip may not be supported." = "SMC sirua ei ehkä tueta.";
"RPM" = "RPM";
"Throttle" = "Throttle";
"↩ Reset to Auto" = "↩️ Palauta automaattisesti";

"Select a profile to adjust the CPU operating range. Changes take effect immediately." = "Valitse profiili, jolla suorittimen käyttöaluetta voidaan säätää. Muutokset tulevat voimaan välittömästi.";

"Directly edit raw P-State registers. Requires kext privilege check disabled via boot-arg or root." = "Muokkaa raakaa P-tilan rekistereitä. Vaatii kext-oikeuksien tarkistamisen pois päältä käynnistyskaaren tai juuren kautta.";
"This will write the raw P-State definitions directly to the CPU. Proceed?" = "Tämä kirjoittaa raaka P-valtion määritelmät suoraan CPU. Jatketaanko?";
"Disabled — work in progress" = "Vammaiset – keskeneräiset työt";
"WIP" = "WIP";

"Enable in OC: Misc → Security → ExposeSensitiveData = 0x08" = "Ota käyttöön OC: Muut → Turvallisuus → ExposeSensitiveData = 0x08";
"Motherboard info not available" = "Emolevyn tiedot eivät ole saatavilla";

"Vista previa de la Barra de Menús:" = "Valikkorivin Esikatselu:";
"Ancho estimado: %dpt" = "Arvioitu leveys: %dpt";
"Restart the app to fully apply width changes." = "Käynnistä sovellus uudelleen, jotta leveyden muutokset voidaan ottaa käyttöön.";
"Small (%dpt)" = "Pieni (%dpt)";
"Medium (%dpt)" = "Keskikokoinen (%dpt)";
"Large (%dpt)" = "Suuri (%dpt)";

"Green" = "Vihreä";
"Blue" = "Sininen";
"Orange" = "Oranssi";
"Red" = "Punainen";
"Purple" = "Violetti";
"Pink" = "Pinkki";
"Teal" = "Sinappi";
"Turquoise" = "Turquoise";

"Verde" = "Vihreä";
"Azul" = "Sininen";
"Naranja" = "Oranssi";
"Rojo" = "Punainen";
"Morado" = "Violetti";
"Rosa" = "Pinkki";
"Turquesa" = "Sinappi";

"Dynamic Colors (Temp Only)" = "Dynaamiset Värit (Vain Lämpötila)";
"Temp Alert Color" = "Väliaikaisen Hälytyksen Väri";
"Temp Alert Limit" = "Väliaikaisen Hälytyksen Raja";
"Network" = "Verkko";
"Network Arrows Color" = "Verkon Nuolien Väri";
"Exit" = "Poistu";
"AMD Power Gadget" = "Amd Virtagadget";
"AMD Power Tool" = "Amd Virtatyökalu";
"SMC Fans" = "SMC Fanit";

"Fan 1" = "Tuuletin 1";
"Fan 2" = "Tuuletin 2";
"Fan 3" = "Fani 3";
"Fan 4" = "Tuuletin 4";
"Fan 5" = "Tuuletin 5";
"Fan 6" = "Putki 6";
"Fan 7" = "Putki 7";
"Fan 8" = "Tuuletin 8";

/* Alerts */
"To enable motherboard display:" = "Ota emolevyn näyttö:";
"Open your OpenCore config file,\n\nGo to Misc -> Security -> ExposeSensitiveData,\n\nSet the value to 0x08 to expose board information." = "Avaa OpenCore asetustiedostosi,\n\nMene Sekalainen -> Security -> ExposeSensitiveData,\n\nAseta arvoksi 0x08 paljastaaksesi aluksella olevia tietoja.";
"Done" = "Valmis";
"Invalid Input" = "Invalid Input";
"Please type in numbers in hexadecimal." = "Kirjoita numerot heksadesimaaliin.";
"Unable to Set PStateDef" = "PStatedef ei voitu asettaa";
"Action was denied as current user does not have enough privilege,\nor was canceled by current user.\n\nRun AMD Power Gadget as root user or disable privilege check with boot-arg '-amdpnopchk'\n\nOtherwise, click 'Once' in the warning message to allow this change." = "Toiminto estettiin, koska nykyisellä käyttäjällä ei ole tarpeeksi etuoikeutta,\ntai nykyinen käyttäjä perui.\n\nSuorita AMD Power Gadget pääkäyttäjän ominaisuutena tai poista käytöstä oikeuksien tarkistus käynnistys-arg '-amdpnopchk'\n\nMuuten Klikkaa 'Once' varoitusviestissä salliaksesi tämän muutoksen.";
"Your changes will not be saved" = "Muutoksiasi ei tallenneta";
"Click apply to save changes before closing this windows." = "Napsauta sovellusta tallentaaksesi muutokset ennen tämän ikkunan sulkemista.";
"Cancel" = "Peruuta";
"Close without saving" = "Sulje tallentamatta";
"Invalid File" = "Virheellinen Tiedosto";
"The selected file could not be read or is not a valid pstate file." = "Valittua tiedostoa ei voitu lukea tai se ei ole kelvollinen pstate tiedosto.";
"OK" = "Ok";

/* Dynamic format strings */
"Avg: %.2f GHz, Max: %.2f GHz" = "Keskiarvo: %.2f Ghz, Max: %.2f GHz";
"%.2f °C" = "%.2f °C";
"%.2f Watt" = "%.2f W";

/* Session Peaks */
"Session Peaks" = "Istunnon Huiput";
"Reset Peaks" = "Nollaa Huiput";

/* GPU Fan Control */
"GPU Fan Control (Zero RPM / Curves)" = "Gpu Puhallin (Zero RPM / Käyrät)";
"macOS Hardware Limitation" = "macOS Laitteiston Rajoitus";
"Direct software-based GPU fan speed overrides (such as zero-rpm toggle or drawing fan curves in macOS) are not supported by the macOS kernel/IOKit driver for AMD GPUs. The GPU's onboard firmware (vBIOS) manages the fans." = "MacOS:n ytimen / IOKit ajuri AMD GPU:ille ei tue suoraa ohjelmistopohjaista grafiikkapuhaltimen nopeuden ohitusta (kuten nolla-rpm vaihde tai piirustus tuulettimien käyrät macOS:ssa). GPU:n laiteohjelmisto (vBIOS) hallinnoi faneja.";
"Standard Hackintosh Solution:" = "Normaali Hackintosh Ratkaisu:";
"The only way to modify this behavior (like forcing fans to spin at lower temperatures or disabling Zero RPM) is by exporting the vBIOS, creating a Soft PowerPlay Table (SPPT), and injecting it via OpenCore's config.plist under DeviceProperties." = "Ainoa tapa muuttaa tätä käyttäytymistä (kuten pakottaa fanit pyöräyttämään alemmissa lämpötiloissa tai poistamaan Zero RPM:n käytöstä) on vBIOSin vienti, luodaan pehmeä PowerPlay-pöytä (SPPT) ja injektoidaan se OpenCoren konfiguroinnin kautta. luettelo laitteiston ominaisuuksista.";
"Open SPPT Guide" = "Avaa SPPT -opas";
"MorePowerTool" = "MorePowerTool";

/* CPPC & EPP */
"Native CPPC Active Mode (EPP)" = "Natiivi CPPC-aktiivitila (Epp)";
"Enables autonomous hardware frequency scaling (recommended)" = "Ottaa käyttöön autonomisen laitteiston taajuusskaalauksen (suositeltu)";
"Power Management Mode" = "Virran Hallintatila";
"Energy Preference (EPP)" = "Energia-Asema (EPP)";
"Select a hardware autonomous profile. The CPU will scale frequency dynamically." = "Valitse laitteiston itsenäinen profiili. Suoritin skaalautuu dynaamisesti.";
"Performance" = "Suorituskyky";
"Balanced Perf" = "Tasapainoinen Perf";
"Balanced Power" = "Tasapainoinen Teho";
"Power Save" = "Virran Tallennus";
"Active Profile Status" = "Aktiivisen Profiilin Tila";
"CPU Speed Profiles (Legacy)" = "Suorittimen Nopeusprofiilit (Legacy)";
"Select a manual P-State override profile. Frequencies will be restricted to the selected step." = "Valitse manuaalinen P-State ohita profiili. Taajuudet rajoitetaan valittuun vaiheeseen.";
"Mode" = "Tila";
"EPP Profile" = "Ep- Profiili";

/* Desktop Widgets */
"Show CPU Widget" = "Näytä CPU Widget";
"Show GPU Widget" = "Näytä GPU-pienoisohjelma";
"Show RAM Widget" = "Show RAM Widget";
"Show Disk Widget" = "Näytä Levywidgetti";
"Show Network Widget" = "Näytä Verkkopainike";
"Show Fan Widget" = "Näytä Tuulettimen Widget";
"Disable All Widgets" = "Poista Kaikki Widgetit Käytöstä";
"Sort by Rank" = "Järjestä sijoituksen mukaan";
"Edit Widget Layout" = "Muokkaa Widgetin Asettelua";
"Unlock widgets to drag them around the screen" = "Avaa widgetit vetääksesi ne näytön ympärille";
"Widget Options" = "Widgetin Asetukset";
"Customize the appearance and behavior of your desktop widgets." = "Mukauta pöytäwidgetit ulkoasua ja käyttäytymistä.";
"Auto-Align Active Widgets" = "Automaattisesti Kohdista Aktiiviset Widgetit";
"Automatically stack active widgets at a corner" = "Pinoa automaattisesti aktiiviset widgetit kulmassa";
"Alignment Corner" = "Tasaus Kulma";
"Top Right" = "Oikea Yläreuna";
"Top Left" = "Vasen Yläreuna";
"Bottom Right" = "Oikea Alareuna";
"Bottom Left" = "Vasemmalla Alhaalla";
"Show Clock Widget" = "Näytä Kellowidget";
"Clock" = "Kello";
"Stats Table" = "Tilastojen Taulukko";
"Classic Glass" = "Klassinen Lasi";
"Pro Monitor" = "Pro Monitor";
"Core Matrix" = "Ydin Matriisi";

"United" = "United";
"Show United Widget" = "Näytä Yhdistetty Widget";
"Configure Combined Metrics" = "Määritä Yhdistetyt Mittarit";
"Include CPU" = "Sisällytä Suoritin";
"Include GPU" = "Sisällytä GPU";
"Include RAM" = "Sisällytä Muisti";
"Include Disk" = "Sisällytä Levy";
"Include Network" = "Sisällytä Verkko";
"Include Fan" = "Sisällytä Tuuletin";

"Temas & Apariencia" = "Teemat Ja Ulkonäkö";
"Análisis" = "Analyysi";

"Select Visual Theme (Instant Application)" = "Valitse Visuaalinen Teema (Instant Application)";
"Custom Theme Creator & Exchange (JSON)" = "Mukautettu Teeman Luoja Ja Vaihto (Json)";
"Chart Rendering Style" = "Kaavion Muotoilu";
"Custom Theme Editor" = "Mukautettu Teemamuokkain";
"Showing active theme colors. Adjust any color to customize." = "Näytetään aktiiviset teeman värit. Säädä mitä tahansa väriä muokattavaksi.";
"Use the Opacity slider for transparency (macOS color panel alone often resets alpha)." = "Käytä Opacity-liukusäädintä läpinäkyvyyden varmistamiseksi (macOS-väripaneeli yksin palauttaa usein alfa).";
"Opacity" = "Läpinäkyvyys";
"Edit Active Theme" = "Muokkaa Aktiivista Teemaa";
"Export Theme (JSON)" = "Vie Teema (JsON)";
"Import Theme (JSON)" = "Tuo Teema (JsON)";
"Card Background" = "Kortin Tausta";
"Cyan Accent" = "Syaani Korostus";
"Orange Accent" = "Oranssi Korostus";
"Green Accent" = "Vihreä Korostus";
"Purple Accent" = "Violetti Korostus";

/* ===== Auto-extracted / curated for Crowdin (v3.16.1+) ===== */
"%.0f" = "%.0f";
"%.0f K/s" = "%.0f K/s";
"%.0f MHz" = "%.0f MHz";
"%.0f%%" = "%.0f%%";
"%.0fG" = "%.0fG";
"%.0f°" = "%.0f°";
"%.0f°C" = "%.0f°C";
"%.0f°C • %.0fW" = "%.0f°C • %.0fW";
"%.1f %@" = "%.1f %@";
"%.1f Ghz" = "%.1f GHz";
"%.1f M/s" = "%.1f M/s";
"%.1f s" = "%.1f s";
"%.1f%%" = "%.1f%%";
"%.1f°C" = "%.1f°C";
"%.2f GHz" = "%.2f GHz";
"%.3f V" = "%.3f V";
"%.4f V" = "%.4f V";
"100°C" = "100 °C";
"1h" = "1t";
"24h" = "24h";
"30d" = "30pv";
"60°C" = "60°C";
"7d" = "7pv";
"Accept & Continue" = "Hyväksy & Jatka";
"Active" = "Aktiivinen";
"All Auto" = "Kaikki Automaattiset";
"All Combined" = "Kaikki Yhdistetty";
"All Fans Auto" = "Kaikki Tuulettimet Autom.";
"AMD CPU Cores" = "Amd CPU Ytimet";
"AMD Power Gadget recolecta datos automáticamente cada minuto." = "AMD Power Gadget recolecta datos automaattinen ticamente cada minuto.";
"AMD Processor Power Manager (PPM)" = "Amd Prosessori Tehonhallinta (Ppm)";
"Analysis" = "Analyysi";
"Apply" = "Käytä";
"Apply P-States?" = "Toteuta P-valtiot?";
"Arrange the order in which resource widgets appear. Click arrows to swap position." = "Järjestä järjestys, jossa resurssiwidgetit näkyvät. Vaihda sijainti napsauttamalla nuolia.";
"Arrow Color" = "Nuolen Väri";
"Automatically switches EPP profiles based on live CPU load" = "Vaihtaa automaattisesti EPP-profiilit, jotka perustuvat suorittimen kuormitukseen";
"Average core frequency in GHz" = "Keskimääräinen ydintaajuus GHz";
"Average utilization over time" = "Keskimääräinen käyttö ajan mittaan";
"Avg Frequency" = "Keskimääräinen Taajuus";
"Avg." = "Keskim.";
"Avg: %.0f%%" = "Keskiarvo: %.0f%%";
"Balanced\n%.1f GHz" = "Balanced\n%.1f GHz";
"Base\n%.1f GHz" = "Base\n%.1f GHz";
"BIOS / Auto" = "BIOS / Auto";
"Buscando actualizaciones..." = "Buscando actualizaciones...";
"Bytes (Read)" = "Tavut (luku)";
"Bytes (Write)" = "Tavut (riitti)";
"Cargando tendencias de telemetría..." = "Cargando tendencias de telemetría...";
"Chart Metric" = "Kaavion Metrinen";
"Chart Type" = "Kaavion Tyyppi";
"Charts require macOS 13+" = "Kartat vaativat macOS 13+";
"Charts require macOS 13.0+" = "Kartat vaativat macOS 13.0+";
"Check for new releases of SMCAMDProcessor and AMD Power Gadget on GitHub." = "Tarkista SMCAMDProcessor ja AMD Power Gadgetin uudet julkaisut GitHubissa.";
"Check for Updates" = "Tarkista päivitykset";
"Check Now" = "Tarkista Nyt";
"Circular Ring" = "Pyöreä rengas";
"Column Bars" = "Sarakkeen Palkit";
"Configure Charts" = "Määritä Kartat";
"Configure labels and layout details for widgets inside the popover." = "Määritä tunnisteet ja asettelun tiedot widgetien sisällä popoverissa.";
"Connection Error: %@" = "Yhteysvirhe: %@";
"Continuous Background Logging" = "Jatkuva Tausta Loki";
"Continuously write telemetry samples to a CSV file in the background" = "Kirjoita telemetrianäytteet jatkuvasti CSV- tiedostoon taustalla";
"Control Mode" = "Ohjaustila";
"Core Rankings (Estimated by Freq)" = "Keskeiset sijoitukset (arviolta Freq)";
"Could not fetch release info." = "Julkaisutietoja ei voitu noutaa.";
"CPPC hardware rankings are active and loaded from the processor." = "CPPC-laitteiston sijoitukset ovat aktiivisia ja ladattu prosessorista.";
"CPPC hardware values could not be read. Rankings are estimated from the maximum observed clock frequency of each core." = "CPPC-laitteiston arvoja ei voitu lukea. Rankingit arvioidaan kunkin ytimen suurimman havaitun kellontiheyden perusteella.";
"CPPC Preferred Cores (Silicon Quality)" = "CPpc Suositellut Ytimet (Kuvakkeen Laatu)";
"CPPC: Active" = "CPPC: Aktiivinen";
"CPPC: Estimated" = "CPPC: Arvioitu";
"CPU and GPU temperatures" = "Suorittimen ja GPU:n lämpötilat";
"CPU Average Frequency" = "Suorittimen Keskimääräinen Taajuus";
"CPU Freq Avg (GHz)" = "Suorittimen Freq Keskim. (GHz)";
"CPU Frequency" = "Suorittimen Taajuus";
"CPU Load" = "Suorittimen Lataus";
"CPU Load (%)" = "Suorittimen Kuorma (%)";
"CPU Package Power" = "Suorittimen Paketin Teho";
"CPU Per-Core Thread Load" = "Suorittimen Per-Ydin Säteen Kuormitus";
"CPU Power" = "Suorittimen Virta";
"CPU Power (W)" = "Suorittimen Teho (V)";
"CPU Power Alert" = "Suorittimen Teho Hälytys";
"CPU power has been at %.1fW (above limit of %dW) for over %d seconds!" = "Suorittimen teho on ollut %.1fW (yläraja %dW) yli %d sekuntia!";
"CPU Temp" = "Suorittimen Lämpötila";
"CPU Temp (°C)" = "Suorittimen Lämpötila (°C)";
"CPU Temperature" = "Suorittimen Lämpötila";
"CPU Temperature Alert" = "Suorittimen Lämpötilahälytys";
"CPU temperature has reached %.1f°C!" = "Suorittimen lämpötila on noussut %.1f°C!";
"CPU Tracker" = "Suorittimen Seuranta";
"Current version: v%@\nNew version: %@\n\nRelease Notes:\n%@" = "Current version: v%@\nNew version: %@\n\nRelease Notes:\n%@";
"Curve" = "Kaari";
"Curve Optimizer is only active when the AMDRyzenCPUPowerManagement kext supports Zen 3 SMU mailbox interface." = "Curve Optimizer on aktiivinen vain, kun AMDRyzenCPUPowerManagement kext tukee Zen 3 SMU mailbox käyttöliittymää.";
"Custom" = "Mukautettu";
"Customize the behavior and visibility of the menu bar popover." = "Muokkaa valikkopalkin popoverin käyttäytymistä ja näkyvyyttä.";
"Cyberpunk Neon" = "Cyberpunk Neon";
"Delete Point" = "Poista Piste";
"Device Utilization %" = "Laitteen Käyttöaste %";
"Disable heavy visual effects if your system lacks Metal graphics acceleration." = "Poista käytöstä raskaat visuaaliset vaikutukset, jos järjestelmästäsi puuttuu Metal graphics acceleration.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user." = "DISCLAIMER: Tämä ohjelmisto on suoraan vuorovaikutuksessa matalan tason laitteiston ohjausrekistereihin. Käyttämällä sitä hyväksyt sen, että ehdoton vastuu järjestelmän epävakaudesta, laitteistovaurioista tai ulkomaalaisten hyökkäyksestä on täysin käyttäjällä.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility rests entirely with the user." = "DISCLAIMER: Tämä ohjelmisto on suoraan vuorovaikutuksessa matalan tason laitteiston ohjausrekistereiden kanssa. Käyttämällä sitä hyväksyt että ehdoton vastuu on täysin käyttäjällä.";
"Disk" = "Levy";
"DISK" = "POISTAA";
"Disk Activity" = "Levyn Toiminta";
"Disk Activity (MB/s)" = "Levyn Toiminta (Mt/s)";
"Disk Activity (Read+Write)" = "Levyn Toiminta (Luku+Kirjaus)";
"Disk I/O" = "Levy I/O";
"Disk Tracker" = "Levyn Seuranta";
"Do you want AMD Power Gadget to start in menu bar at login? \n\n This will only be asked once. You can change this setting later under Appearance menu." = "Haluatko AMD Power Gadget -laitteen käynnistyvän valikkopalkissa? \n\n Tästä kysytään vain kerran. Voit muuttaa tätä asetusta myöhemmin ulkonäön valikosta.";
"Donate (PayPal)" = "Lahjoita (PayPal)";
"Download" = "Lataa";
"Download on GitHub" = "Lataa GitHubista";
"Download Update" = "Lataa Päivitys";
"Drag control points to edit curve. Double-click empty space to add (max 8). Double-click a point or right-click to delete." = "Vedä ohjauspisteitä muokataksesi käyrää. Kaksoisnapsauta tyhjää tilaa lisätäksesi (max 8). Kaksoisnapsauta pistettä tai napsauta hiiren kakkospainikkeella poistaaksesi.";
"Dynamic Auto-EPP Workload Engine" = "Dynamic Auto-EPP Workload Engine";
"Dynamic Next-Gen Fan Curves" = "Dynaamiset Seuraava-Kenraaliset Puhallinkäyrät";
"Edit Layout" = "Muokkaa Asettelua";
"Efficient\n%.1f GHz" = "Tehokas\n%.1f GHz";
"Enable additional stats columns inside the popover." = "Ota käyttöön lisätilastot sarakkeet popoverin sisällä.";
"Enable System Alerts" = "Ota Käyttöön Järjestelmähälytykset";
"Error reading CPU data." = "Virhe luettaessa CPU tietoja.";
"Evaluated in the kernel with 256-step LUT interpolation, hysteresis, and smooth ramping." = "Arvioitu ytimessä 256-vaiheinen LUT interpolointi, hystereesi ja sileä luiskaus.";
"Export" = "Vie";
"Export CSV" = "Vie CSV";
"Export Telemetry History" = "Vie Telemetrian Historia";
"Export the history of samples currently in memory to a CSV file" = "Vie tällä hetkellä muistissa olevien näytteiden historia CSV-tiedostoon";
"Failed — check kext privileges (-amdpnopchk)." = "Epäonnistui — tarkista kextin oikeudet (-amdpnopchk).";
"Fan" = "Fani";
"Fan Number" = "Puhaltimen Numero";
"Fan Speed" = "Puhaltimen Nopeus";
"Fan Speed (RPM)" = "Puhaltimen Nopeus (RPM)";
"Fan Speed(RPM)" = "Puhaltimen Nopeus(RPM)";
"Filled Area" = "Täytetty Alue";
"Freq:" = "Freq:";
"Frequency" = "Taajuus";
"Frequency Max:" = "Taajuus Max:";
"GHz" = "GHz";
"GitHub Repository" = "GitHub Repository";
"GitHub Repository\n\nSpecial thanks to the AMD OS X community!\n\nCopyright © 2020-2026 Droga. All rights reserved." = "GitHub Repository\n\nErikoiskiitos AMD OS X -yhteisölle!\n\nCopyright ©️ 2020-2026 Droga. Kaikki oikeudet pidätetään.";
"GPU Load" = "Gpu:N Lataus";
"GPU Model" = "Gpu Malli";
"GPU Power" = "Gpu:N Virta";
"GPU Power (W)" = "Gpu Teho (V)";
"GPU Temp" = "GPU Temp";
"GPU Temp (°C)" = "GPU-lämpötila (°C)";
"GPU Temperature" = "GPU Lämpötila";
"GPU Tracker" = "Gpu- Seurantapalvelin";
"H.264 & HEVC Active" = "H.264 & HEVC Aktiivinen";
"H.264 Active (HEVC Inactive)" = "H.264 Aktiivinen (Hevc Ei Aktiivinen)";
"HEVC Active (H.264 Inactive)" = "HEVC Aktiivinen (H.264 Epäaktiivinen)";
"Hide this fan" = "Piilota tämä tuuletin";
"High Load Threshold (Performance)" = "Korkea Kuormituskynnys (Suorituskyky)";
"Histograma de Barras" = "Histograma de Barras";
"Hysteresis" = "Hysteresis";
"I accept that absolute responsibility lies entirely with the user." = "Hyväksyn sen, että ehdoton vastuu kuuluu täysin käyttäjälle.";
"Idle Threshold (Power Save)" = "Jouten Kynnysarvo (Power Save)";
"Import" = "Tuo";
"Inactive" = "Passiivinen";
"Inactive / Not Supported" = "Passiivinen / Ei Tuettu";
"Index" = "Indeksi";
"Inject positive or negative voltage offsets per core. Center is 0 (no override). Limit: -30 (undervolt) to +30 (overvolt) counts." = "Injektoidaan positiivisia tai negatiivisia jännitepoikkeamia ytimessä. Keskitys on 0 (ei yliviivattu). Raja: -30 (alijännite) - +30 (ylijännitearvot.";
"Inst(s) Retired:" = "Inst(s) Vahvistettu:";
"Kext Update Available" = "Kext Päivitys Saatavilla";
"Later" = "Myöhemmin";
"Line Only" = "Vain Rivi";
"Load" = "Lataa";
"Loading..." = "Ladataan...";
"Log File Location" = "Lokitiedoston Sijainti";
"Logical Cores" = "Loogiset Ytimet";
"Low Performance Mode" = "Matalan Suorituskyvyn Tila";
"Low Power\n%.1f GHz" = "Low Power\n%.1f GHz";
"Línea Escalonada (Step)" = "LiŽnea Escalonada (Step)";
"Línea Suave (Spline)" = "Kuormalava (Spline)";
"Manual Override" = "Ohita Käsin";
"Max Speed" = "Maksimi Nopeus";
"Max." = "Maks.";
"MB/s" = "Mt/s";
"Memory Usage" = "Muistin Käyttö";
"Menu Bar Preview:" = "Valikkorivin Esikatselu:";
"Mi Tema Custom" = "Mi Tema Custom";
"Min." = "Min.";
"Monochrome Stealth" = "Yksivärinen Stealth";
"Máx." = "Postitoimipaikka x.";
"Máx:" = "Tehostettu x:";
"Mín." = "Maksimi n.";
"Mín:" = "Kutistuva:";
"N/A" = "E/A";
"Net" = "Verkko";
"Net Download (MB/s)" = "Nettolataus (Mt/s)";
"Net Upload (MB/s)" = "Nettokuormitus (Mt/s)";
"Network Speed" = "Verkon Nopeus";
"Network Throughput" = "Verkko Koko";
"Network Total Speed" = "Verkon Kokonaisnopeus";
"New version %@ available!" = "Uusi versio %@ saatavilla!";
"New Version Available: %@" = "Uusi Versio Saatavana: %@";
"No" = "Ei";
"No AMDRyzenCPUPowerManagement Found!" = "AMDRyzenCPUPowerManagement Ei Löytynyt!";
"No curves configured." = "Kaareja ei ole määritetty.";
"No hay suficientes datos recolectados aún." = "No hay suficientes datos recolectados aún.";
"No location selected" = "Sijaintia ei ole valittu";
"No metrics active" = "Ei aktiivisia mittareita";
"No release notes available." = "Julkaisutietoja ei ole saatavilla.";
"Nordic Frost" = "Pohjoismainen Frost";
"Not Supported" = "Ei Tueta";
"Not supported by your CPU" = "CPU ei ole tuettu";
"Not yet" = "Ei vielä";
"Open Dashboard" = "Avaa Kojelauta";
"Other Popover Widgets" = "Muut Popover Widgets";
"P-State Editor" = "P-osainen Editori";
"P-States applied successfully." = "P-valtiot sovellettiin onnistuneesti.";
"P-States Configuration" = "P-Osavaltioiden Asetukset";
"Package" = "Paketti";
"Package Power" = "Paketin Teho";
"Peak Fan" = "Huipputuulettimen Name";
"Peak Freq" = "Huippu Freq";
"Peak Power" = "Huipputeho";
"Peak Temp" = "Huippu Temp";
"Performance\n%.1f GHz" = "Performance\n%.1f GHz";
"Performance & Fallback" = "Suorituskyky Ja Pudotus";
"Personalizado" = "Personalizado";
"Physical Cores" = "Fyysiset Ytimet";
"Pin Popover Open" = "Kiinnitä Popover Avaa";
"Platform" = "Alusta";
"Please download AMDRyzenCPUPowerManagement from the release page." = "Ole hyvä ja lataa AMDRyzenCPUPowerManagement julkaisusivulta.";
"Popover Config" = "Popover Config";
"Popover General Settings" = "Popover Yleiset Asetukset";
"Popover Menu" = "Popover Menu";
"Power" = "Virta";
"Power Warning Threshold (PPT)" = "Virran Varoituskynnys (Ppt)";
"Prevent the popover from closing when clicking outside" = "Estä ponnahdusikkuna sulkeutumasta, kun napsautat ulkoa";
"Preview" = "Esikatselu";
"Processor" = "Prosessori";
"Profile" = "Profiili";
"Progress Bar" = "Progress-palkki";
"Prom." = "Prom.";
"PWR" = "PWR";
"Quick Fan Access" = "Nopea Puhallin Pääsy";
"Quit" = "Lopeta";
"Quit and Download" = "Lopeta ja lataa";
"Radeon GPU" = "Radeon GPU";
"Radeon Graphics utilization percentage" = "Radeon Graphics käytön prosenttiosuus";
"RAM" = "RAM";
"RAM Tracker" = "Ram Seurantapalvelin";
"RAM Usage" = "RAM Usage";
"RAM Usage (%)" = "RAM Usage (%)";
"RAM Utilization" = "RAM Utilization";
"RAM utilization percentage" = "RAM-muistin käyttöprosentti";
"Ramp Rate" = "Rampin Nopeus";
"Raw Register Details" = "Raaka Rekisterin Tiedot";
"Read Speed" = "Lue Nopeus";
"Real-time energy consumption in Watts" = "Reaaliaikainen energiankulutus watteina";
"Real-time History" = "Reaaliaikainen Historia";
"Real-time upload / download speed (↑/↓)" = "Reaaliaikainen lataus / latausnopeus (↑/↓)";
"Receive native macOS alerts when the CPU exceeds configured thermal or power limits." = "Vastaanota alkuperäiset macOS-hälytykset, kun suoritin ylittää määritetyt lämpö- tai tehorajat.";
"Refresh Rate" = "Päivitä Hinta";
"Relative Time (s)" = "Suhteellinen Aika (s)";
"Replaces translucent blurs with solid colors to save CPU" = "Korvaa läpikuultavat sumennukset kiinteillä väreillä tallentaaksesi suorittimen";
"Requests permission and enables hardware limit warnings" = "Pyytää käyttöoikeuksia ja ottaa käyttöön laitteiston rajavaroitukset";
"Revert" = "Palauta";
"Right-click any widget directly on your desktop to change its style dynamically (Classic Glass, Pro Monitor, or Core Matrix)." = "Napsauta hiiren oikealla painikkeella mitä tahansa widget suoraan työpöydälle muuttaa sen tyyliä dynaamisesti (Classic Glass, Pro Monitor, tai Core Matrix).";
"SAFETY DISCLAIMER & LIABILITY AGREEMENT" = "TURVALLISUUS- JA VASTUUSSOPIMUSSOPIMUS";
"Seleccioná una gráfica en el panel superior para visualizar su histórico." = "SeleccionaŽuna graěfica en el panel superior para visualizar su histoλ rico.";
"Select File..." = "Valitse Tiedosto...";
"Select which metrics are shown and choose their visualization style." = "Valitse mitkä mittarit näytetään ja valitse niiden visualisointityyli.";
"Series" = "Sarja";
"Show a floating, non-interactive widget on your desktop for live telemetry." = "Näytä kelluva, ei-interaktiivinen widget työpöydälläsi live-telemetriaa varten.";
"Show All (%d hidden)" = "Näytä kaikki (%d piilotettu)";
"Show CPU" = "Näytä Suoritin";
"Show Fan RPM" = "Näytä Puhallin RPM";
"Show GPU Power" = "Näytä GPU-teho";
"Show GPU Row" = "Näytä GPU-rivi";
"Show GPU Temp" = "Näytä GPU Temp";
"Show Memory" = "Näytä Muisti";
"Show Network" = "Näytä Verkko";
"Show Network Row" = "Näytä Verkon Rivi";
"Show Network Speed Sparkline Graph below" = "Näytä verkon nopeus Sparkline -kaavio alla";
"Show Per-Core Utilization Grid below" = "Näytä Ydinmateriaalien käyttöruutu alla";
"Show Power" = "Näytä Virta";
"Show Ring Details" = "Näytä Soittotiedot";
"Show Ring Labels" = "Näytä Soittomerkit";
"Show Temperature" = "Näytä Lämpötila";
"Show Temperature Sparkline Graph below" = "Näytä alla oleva lämpötilakaavio";
"Show Top Processes" = "Näytä Parhaat Prosessit";
"Single large value instead of max/avg stack" = "Yksi suuri arvo max/avg pino sijasta";
"SMC Fan Control" = "SMC Puhaltimen Hallinta";
"Smooth Curves" = "Pehmeät Käyrät";
"Software" = "Ohjelmisto";
"Software Updates" = "Ohjelmiston Päivitykset";
"Solarized Amber" = "Solaroitu Meripihka";
"Speed" = "Nopeus";
"SSD" = "SSD";
"Startup at login?" = "Käynnistetäänkö kirjautuessasi?";
"Statistics" = "Tilastot";
"Storage" = "Tallennustila";
"Style" = "Tyyli";
"Style Options" = "Tyylin Asetukset";
"Styles & Themes" = "Styles & Themes";
"Supported by your CPU" = "Suorittimen tukema";
"Sustained Duration" = "Kesto Kesto";
"Swap Total" = "Vaihda Yhteensä";
"Swap Used" = "Vaihda Käytetty";
"System Alert Notifications" = "Järjestelmän Hälytysilmoitukset";
"System Up to Date" = "Järjestelmä ajan tasalla";
"Tahoe Glass" = "Tahoe Lasi";
"Temp" = "Väliaikainen";
"Temp Source" = "Väliaikaisen Lähde";
"Temperature" = "Lämpötila";
"Temperature Warning Threshold" = "Lämpötilan Varoituskynnys";
"Temperature(C)" = "Lämpötila (C)";
"Temperatures" = "Lämpötilat";
"Themes & Appearance" = "Teemat Ja Ulkonäkö";
"Thermal History" = "Lämpöhistoria";
"This application can not be launched due to AMDRyzenCPUPowerManagement is reporting incorrect data." = "Tätä sovellusta ei voi käynnistää AMDRyzenCPUPowerManagement ilmoittaa virheellisistä tiedoista.";
"This software interacts directly with low-level CPU hardware registers, Model-Specific Registers (MSRs), and the System Management Unit (SMU) to control CPU voltages, frequencies, and power limits.\n\nIncorrect settings, unstable undervolting, or wrong configurations can cause system instability, data loss, kernel panics, or permanent hardware damage.\n\nBy continuing, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user. The authors and contributors assume no liability whatsoever for any damage, loss, or side effects to your hardware, software, or personal property. Use at your own risk." = "Tämä ohjelmisto on suoraan vuorovaikutuksessa matalan tason CPU-laitteistorekistereiden, mallikohtaisten rekisterien (MSR) kanssa, ja järjestelmän hallintayksikkö (SMU) ohjaamaan suorittimen jännitteitä, taajuuksia ja tehorajoja.\n\nVäärät asetukset, epävakaa alijännitys tai väärät konfiguraatiot voivat aiheuttaa järjestelmän epävakautta, tietojen katoamista, ytimen paniikkia tai pysyviä laitteistovaurioita.\n\nJatkamalla hyväksyt sen, että ehdoton vastuu järjestelmän epävakaudesta, laitteistovaurioista tai ulkomaalaisten hyökkäyksestä on täysin käyttäjällä. Tekijät ja avustajat eivät ota mitään vastuuta mistään vahingoista, menetyksistä, tai sivuvaikutuksista laitteistoon, ohjelmistoon, tai henkilökohtaiseen omaisuuteen. Käytä omalla vastuulla.";
"Thread %d: %.1f%%" = "Thread %d: %.1f%%";
"Time" = "Aika";
"Timeframe" = "Timeframe";
"Timestamp" = "Aikaleima";
"TMP" = "TMP";
"Todas las gráficas están ocultas." = "Todas las gráficas están ocultas.";
"Top Processes" = "Parhaat Prosessit";
"Total" = "Yhteensä";
"Total Power(W)" = "Kokonaisteho (W)";
"Tracks active memory usage and pressure." = "Seuraa aktiivista muistin käyttöä ja painetta.";
"Tracks CPU utilization average and core temperature." = "Kappaleita suorittimen käytön keskiarvo ja ydin lämpötila.";
"Tracks graphics memory (VRAM) utilization." = "Seuraa grafiikkamuistin (VRAM) käyttöä.";
"Tracks graphics utilization and temperature." = "Seuraa grafiikan käyttöä ja lämpötilaa.";
"Tracks primary storage capacity usage." = "Raitojen ensisijainen tallennuskapasiteetin käyttö.";
"Unknown" = "Tuntematon";
"Unknown GPU" = "Tuntematon GPU";
"Unlock Curve Optimizer (DANGEROUS: unstable undervolting can cause kernel panic or instant reboot)" = "Avaa käyrän optimointi (DANGEROUS: epävakaa alijännitys voi aiheuttaa ytimen paniikin tai pikakäynnistyksen)";
"Unlock P-State Editor (DANGEROUS: incorrect settings can crash or damage hardware)" = "Avaa P-tilan editori (DANGEROUS: väärät asetukset voivat kaatua tai vahingoittaa laitteistoa)";
"Upload" = "Lähetä";
"Uptime" = "Käyttöaika";
"Use Popover Menu" = "Käytä Popover -valikkoa";
"Used memory in GB" = "Käytetty muistia GB";
"Used RAM" = "Used RAM";
"UTC Time" = "Utc Aika";
"V-F Operating Curve" = "V–F Käyttökäyrä";
"Value" = "Arvo";
"VDA Decoder" = "VDA Decoder";
"Visible charts:" = "Näkyvät kaaviot:";
"Volt:" = "Volt:";
"VRAM" = "VRAM";
"VRAM Tracker" = "VRAM Seuranta";
"VRAM Used" = "VRAM Käytetty";
"VRAM: %.2fG%@" = "VRAM: %.2fG%@";
"W" = "W";
"Weekday" = "Arkipäivä";
"Widget Reordering" = "Widgetin Järjestys";
"Widget Selection & Display Style" = "Widgetin Valinta Ja Näyttötyyli";
"Widget Style" = "Widgetin Tyyli";
"Write Speed" = "Kirjoita Nopeus";
"Yes" = "Kyllä";
"You are running the most recent version of AMD Power Gadget (v%@)." = "Käytössäsi on uusin versio AMD Power Gadget (v%@).";
"You have the latest version installed (v%@)." = "Sinulla on uusin versio asennettu (v%@).";
"°C" = "°C";
"Área Rellena (Gradient)" = "AŽrea Rellena (Gradient)";

/* Compatibility / format keys */
"Your AMDRyzenCPUPowerManagement version (%@) is outdated and no longer API compatible. Please use version 3.0.0 or newer and start this application again." = "AMDRyzenCPUPowerManagement versio (%@) on vanhentunut eikä sovellusrajapinta enää ole yhteensopiva. Käytä versiota 3.0.0 tai uudempaa ja käynnistä sovellus uudelleen.";

/* App language picker */
"Language" = "Kieli";
"App Language" = "Sovelluksen Kieli";
"Choose the interface language. The app will restart to apply the change." = "Valitse käyttöliittymän kieli. Sovellus käynnistyy uudelleen, jotta muutos voidaan ottaa käyttöön.";
"System Default" = "Järjestelmän Oletus";
"Current: %@" = "Nykyinen: %@";
"Restart required" = "Uudelleenkäynnistys vaaditaan";
"Apply & Restart" = "Käytä Uudelleenkäynnistystä";
"The app needs to restart to load the selected language." = "Sovelluksen täytyy käynnistää uudelleen, jotta se voi ladata valitun kielen.";

/* Privilege UX */
"This action requires administrator privileges. Run AMD Power Gadget as root, or add the boot argument -amdpnopchk for debugging." = "Tämä toiminto vaatii järjestelmänvalvojan oikeudet. Suorita AMD Power Gadget roottina tai lisää käynnistysargumentti -amdpnopchk vianetsintää varten.";

/* Crowdin: recent UI strings */